Autodesk.Navisworks.Api.GridsOptions
Provides access to Grids Options

Autodesk.Navisworks.Api.GridsOptions.AboveColor
The color of the Grid lines on the level directly above the camera.

Autodesk.Navisworks.Api.GridsOptions.BelowColor
The color of the Grid lines on the level directly below the camera.

Autodesk.Navisworks.Api.GridsOptions.Enabled
Determines if Grids will rendered.

Autodesk.Navisworks.Api.GridsOptions.OtherColor
The color of the Grid lines on levels not directly above or below the camera.

Autodesk.Navisworks.Api.GridsOptions.XRayMode
Renders occluded grid lines.